cask_args appdir: '/Applications'

tap 'jesseduffield/lazygit'
tap 'koekeishiya/formulae'
tap 'kdash-rs/kdash'
tap "FelixKratz/formulae"               # For janky borders



# Pre-req's
brew "mas" # Mac App Store CLI - https://github.com/mas-cli/mas



# CLI Basics
brew 'aria2'        # Resuming download util (better wget)
brew 'bat'          # Output highlighting (better cat)
brew 'broot'        # Interactive directory navigation
brew 'ctags'        # Indexing of file info + headers
brew 'diff-so-fancy'# Readable file compares (better diff)
brew 'duf'          # Get info on mounted disks (better df)
brew 'entr'         # Run command whenever file changes
brew 'exiftool'     # Read, write and modify exif data
brew 'fzf'          # Fuzzy file finder and filtering
brew 'hyperfine'    # Benchmarking for arbitrary commands
brew 'fclones'      # Duplicate file finder (faster than jdupes)
brew 'just'         # Powerful command runner (better make)
brew 'jq'           # JSON parser, output and query files
brew 'most'         # Multi-window scroll pager (better less)
brew 'procs'        # Advanced process viewer (better ps)
brew 'ripgrep'      # Searching within files (better grep)
brew 'rsync'        # Fast incremental file transfer
brew 'sd'           # RegEx find and replace (better sed)
brew 'tokei'        # Count lines of code (better cloc)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'watch'        # Run commands periorically
brew 'zoxide'       # Auto-learning navigation (better cd)
brew 'fd'           # Better find
brew 'telnet'
brew 'eza'          # Better ls

# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor 
brew 'ctop'         # Container metrics and monitoring
brew 'doggo'        # DNS lookup client (better dig)
brew 'btop'         # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'goaccess'     # Web log analyzer and viewer
brew 'gping'        # Interactive ping tool, with graph
brew 'speedtest-cli'# Command line speed test utility


# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazydocker'   # Full Docker management app
brew 'lazygit'      # Full Git management app
brew 'kdash'        # Kubernetes management
brew 'k9s'
brew 'awscli'
brew 'redpanda-data/tap/redpanda'
brew 'harlequin'
brew 'pgcli'
cask '1password-cli'
brew 'gh'           # GitHub CLI - Interact with GitHub PRs, issues, repos
brew 'mosh'

# CLI External Sercvices
cask 'ngrok'        # Reverse proxy for sharing localhost
brew 'navi'         # Browse, search, read cheat sheets

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'postman'        # HTTP API testing app

# Development Langs, Compilers, Package Managers and SDKs
brew 'gcc'            # GNU C++ compilers
brew 'go'             # Compiler for Go Lang
brew 'node'           # Node.js
brew 'openjdk'        # Java development kit
brew 'python'         # Python interpreter
brew 'ipython'
brew 'rust'           # Rust language
brew 'lua'            # Lua interpreter
brew 'luarocks'       # Package manager for Lua

# Development Utils
brew 'mise'           # Runtime manager (asdf rust clone)
brew 'uv'
brew 'git-extras'     # Extra git commands for common tasks
brew 'terminal-notifier' # Trigger Mac notifications from terminal
brew 'tig'            # Text-mode interface for git
brew 'watchman'       # Watch for changes and reload dev server
brew 'direnv'         # Project-specific environment variables
brew 'mkcert'         # Local HTTPS development certificates
brew 'dive'           # Docker image layer explorer


#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

## Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'
cask "font-anonymice-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-powerline-symbols"

# Browsers
cask "arc" #unless system "test '[ -d /Applications/Arc.app/ ]'"


# Communication
cask "discord"
cask "slack"
cask 'zoom'


# Editors
cask "pycharm"
cask "visual-studio-code"
cask 'zed'
cask 'Dbeaver-community'

# Entertainment
cask "vlc"

# CLI Essentials
brew 'git'          # Version controll
brew 'neovim'       # Text editor
brew 'ranger'       # Directory browser
brew 'tmux'         # Term multiplexer

# Terminals (Consolidated - keeping top 3)
brew "fish"
cask "warp"         # AI-powered terminal
cask "kitty"        # GPU-accelerated terminal
cask "ghostty"      # New native terminal
brew "starship"
brew 'pipx'

# Utility
cask "orbstack"
brew 'kubelogin'

cask "keka"

# Media
cask 'spotify', args: { require_sha: false }


# Personal Applications
cask '1password'      # Password manager (proprietary)
cask "appcleaner"
cask "cyberduck"
cask 'mountain-duck'  # Mount remote storage locations
cask 'tailscale-app'  # Tailscale GUI app (renamed from 'tailscale')
cask "notion"
cask "raycast"
cask 'arq'
cask 'sloth'
cask 'meetingbar'
cask 'logseq'
cask 'Dropbox'
mas 'Endel', id:1346247457

# Mac OS Mods and Improvments
cask 'contexts'        # Much better alt-tab window switcher
cask 'logi-options-plus' # Logitech MX Master support
cask 'espanso'        # Live text expander (cross-platform)
cask 'hiddenbar'      # Hide / show annoying menubar icons
brew 'iproute2mac'    # MacOS port of netstat and ifconfig
cask 'openinterminal' # Finder button, opens directory in terminal
cask "nikitabobko/tap/aerospace"
brew 'borders'
cask 'font-hack-nerd-font'
cask 'font-monaspace'
