cask_args appdir: "/Applications"

tap "ankitpokhrel/jira-cli"
tap "antoniorodr/memo"
tap "atlassian/acli"
tap "felixkratz/formulae"
tap "int128/kubelogin"
tap "jesseduffield/lazygit"
tap "kdash-rs/kdash"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "redpanda-data/tap"
tap "robusta-dev/krr"
tap "runpod/runpodctl"
tap "ubicloud/cli"
tap "steipete/tap"
tap "asheshgoplani/tap"
tap "tw93/tap"
tap "yakitrak/yakitrak"
tap "jazzyalex/agent-sessions"
tap "zackriya-solutions/meetily"



# Pre-req's
brew "mas" # Mac App Store CLI - https://github.com/mas-cli/mas



# CLI Basics
brew "aria2"        # Resuming download util (better wget)
brew "bat"          # Output highlighting (better cat)
brew "ctags"        # Indexing of file info + headers
brew "duf"          # Get info on mounted disks (better df)
brew "entr"         # Run command whenever file changes
brew "exiftool"     # Read, write and modify exif data
brew "fzf"          # Fuzzy file finder and filtering
brew "hyperfine"    # Benchmarking for arbitrary commands
brew "fclones"      # Duplicate file finder (faster than jdupes)
brew "just"         # Powerful command runner (better make)
brew "jq"           # JSON parser, output and query files
brew "lzop"         # Fast compression
brew "most"         # Multi-window scroll pager (better less)
brew "procs"        # Advanced process viewer (better ps)
brew "ripgrep"      # Searching within files (better grep)
brew "rsync"        # Fast incremental file transfer
brew "sd"           # RegEx find and replace (better sed)
brew "tokei"        # Count lines of code (better cloc)
brew "tree"         # Directory listings as tree structure
brew "trash-cli"    # Record and restore removed files
brew "watch"        # Run commands periorically
brew "uutils-coreutils" # Modern coreutils in Rust
brew "atuin"        # Shell history sync and search
brew "zoxide"       # Auto-learning navigation (better cd)
brew "fd"           # Better find
brew "telnet"
brew "eza"          # Better ls
brew "yt-dlp"       # YouTube downloader

# CLI Monitoring and Performance Apps
brew "bmon"         # Bandwidth utilization monitor
brew "ctop"         # Container metrics and monitoring
brew "doggo"        # DNS lookup client (better dig)
brew "btop"         # Resource monitoring (like htop)
brew "htop"         # Interactive process viewer
brew "dua-cli"      # Disk usage analyzer and monitor (better du)
brew "fio"          # Flexible I/O tester and benchmarking
brew "glances"      # System monitoring tool
brew "goaccess"     # Web log analyzer and viewer
brew "gping"        # Interactive ping tool, with graph
brew "speedtest-cli"# Command line speed test utility


# CLI Development Suits
brew "httpie"       # HTTP / API testing testing client
brew "lazydocker"   # Full Docker management app
brew "lazygit"      # Full Git management app
brew "kdash"        # Kubernetes management
brew "k9s"
brew "hcloud"        # Hetzner Cloud CLI
brew "awscli"
brew "redpanda-data/tap/redpanda"
brew "harlequin"
brew "pgcli"
brew "gh"           # GitHub CLI - Interact with GitHub PRs, issues, repos
brew "mosh"
brew "jira-cli"     # Jira CLI
brew "antoniorodr/memo/memo"   # Memo taking tool
brew "atlassian/acli/acli"     # Atlassian CLI
brew "int128/kubelogin/kubelogin" # Kubernetes OpenID Connect authentication
brew "robusta-dev/krr/krr"     # Kubernetes resource recommender
brew "runpod/runpodctl/runpodctl" # RunPod CLI
brew "ubicloud/cli/ubi"        # Ubicloud CLI
brew "steipete/tap/summarize"  # AI text summarization
brew "steipete/tap/remindctl"  # macOS Reminders CLI
brew "asheshgoplani/tap/agent-deck" # AI agent tool
brew "tw93/tap/mole"           # Terminal tool
brew "yakitrak/yakitrak/obsidian-cli" # Obsidian CLI

# CLI External Services
brew "navi"         # Browse, search, read cheat sheets

#############################################################
# Software Development                                      #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew "gcc"            # GNU C++ compilers
# Languages managed by mise (see ~/.mise.toml): go, node, python, rust, java, lua
brew "oven-sh/bun/bun" # Fast all-in-one JavaScript runtime

# Development Utils
brew "mise"           # Runtime manager (asdf rust clone)
brew "uv"
brew "devcontainer"   # Dev Container CLI
brew "duckdb"         # Analytical database
brew "gemini-cli", link: false # Google Gemini CLI
brew "git-extras"     # Extra git commands for common tasks
brew "git-lfs"        # Git large file storage
brew "terminal-notifier" # Trigger Mac notifications from terminal
brew "tig"            # Text-mode interface for git
brew "watchman"       # Watch for changes and reload dev server
brew "mkcert"         # Local HTTPS development certificates
brew "dive"           # Docker image layer explorer

# Secret Detection
brew "gitleaks"       # Secret scanning tool (primary)
brew "trufflesecurity/trufflehog/trufflehog" # Secret verification (secondary)
brew "pre-commit"     # Git hook framework


#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

## Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-meslo-lg-nerd-font"
cask "font-anonymice-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-powerline-symbols"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"

# Browsers
cask "arc" #unless system "test '[ -d /Applications/Arc.app/ ]'"
cask "google-chrome" #unless system "test '[ -d /Applications/Chrome.app/ ]'"


# Communication
cask "discord"
cask "slack"
cask "zoom"


# Editors
cask "pycharm"
cask "visual-studio-code"
cask "zed"
cask "codex"            # OpenAI Codex CLI
cask "dbeaver-community"
cask "claude-code"

# VScode extensions
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"

# Entertainment
cask "iina"

# CLI Essentials
brew "git"          # Version controll
brew "neovim"       # Text editor
brew "stow"         # Dotfile symlink manager
brew "tmux"         # Term multiplexer
brew "tmuxinator"   #

# Terminals
brew "fish"
cask "ghostty@tip"      # New native terminal
brew "starship"

# Utility
brew "syncthing"     # P2P file synchronization
cask "agent-sessions"   # AI agent session manager
cask "battery"          # Battery management
cask "orbstack"
cask "devpod"       # Development environments
cask "intune-company-portal"
cask "keka"
cask "kopiaui"      # Backup tool
#cask "ngrok"        # Reverse proxy for sharing localhost
brew "yazi"

# Media
cask "spotify", args: { require_sha: false }


# Personal Applications
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "appcleaner"
cask "cyberduck"
cask "mountain-duck"  # Mount remote storage locations
cask "tailscale-app"  # Tailscale GUI app (renamed from 'tailscale')
cask "notion"
cask "raycast"
cask "arq"
cask "sloth"
cask "meetingbar"
cask "meetily"        # Meeting scheduling
cask "dayflow"        # Journaling app
cask "logseq"
cask "dropbox"
mas "Duplicate File Finder", id: 1032755628
mas "Endel", id: 1346247457
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466

# Mac OS Mods and Improvments
cask "contexts"        # Much better alt-tab window switcher
cask "logi-options+" # Logitech MX Master support
cask "espanso"        # Live text expander (cross-platform)
cask "hiddenbar"      # Hide / show annoying menubar icons
brew "iproute2mac"    # MacOS port of netstat and ifconfig
cask "openinterminal" # Finder button, opens directory in terminal
cask "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/borders"
