# Core CLI and developer tools. GUI apps, fonts, and VS Code extensions live in Brewfile.desktop.

cask_args appdir: "/Applications"

#############################################################
# Pre-reqs                                                  #
#############################################################

brew "mas" # Mac App Store CLI - https://github.com/mas-cli/mas

#############################################################
# CLI Basics                                                #
#############################################################

brew "aria2"        # Resuming download util (better wget)
brew "bat"          # Output highlighting (better cat)
brew "ctags"        # Indexing of file info + headers
brew "duf"          # Get info on mounted disks (better df)
brew "entr"         # Run command whenever file changes
brew "exiftool"     # Read, write and modify exif data
brew "fzf"          # Fuzzy file finder and filtering
brew "hyperfine"    # Benchmarking for arbitrary commands
brew "czkawka"      # Duplicate/empty file & similar image finder
brew "just"         # Powerful command runner (better make)
brew "jq"           # JSON parser, output and query files
brew "lzop"         # Fast compression
brew "most"         # Multi-window scroll pager (better less)
brew "procs"        # Advanced process viewer (better ps)
brew "ripgrep"      # Searching within files (better grep)
brew "rsync"        # Fast incremental file transfer
brew "sd"           # RegEx find and replace (better sed)
brew "tokei"        # Count lines of code (better cloc)
brew "tree"         # Directory listings as tree structure
brew "trash-cli"    # Record and restore removed files
brew "watch"        # Run commands periodically
brew "uutils-coreutils" # Modern coreutils in Rust
brew "atuin"        # Shell history sync and search
brew "zoxide"       # Auto-learning navigation (better cd)
brew "fd"           # Better find
brew "direnv"       # Load per-directory environment variables
brew "telnet"
brew "eza"          # Better ls
brew "grc"          # Generic colouriser (required by the orefalo/grc fisher plugin)

#############################################################
# CLI Monitoring and Performance Apps                       #
#############################################################

brew "bmon"         # Bandwidth utilization monitor
brew "ctop"         # Container metrics and monitoring
brew "doggo"        # DNS lookup client (better dig)
brew "btop"         # Resource monitoring (like htop)
brew "htop"         # Interactive process viewer
brew "dua-cli"      # Disk usage analyzer and monitor (better du)
brew "fio"          # Flexible I/O tester and benchmarking
brew "glances"      # System monitoring tool
brew "goaccess"     # Web log analyzer and viewer
brew "gping"        # Interactive ping tool, with graph
brew "speedtest-cli" # Command line speed test utility

#############################################################
# CLI Development Suites                                    #
#############################################################

brew "httpie"       # HTTP / API testing testing client
brew "lazydocker"   # Full Docker management app
brew "lazygit"      # Full Git management app
brew "git-delta"    # syntax highlighting for lazygit
brew "k9s"
brew "helm"
brew "kind"
brew "kdash-rs/kdash/kdash", trusted: true
brew "hcloud"       # Hetzner Cloud CLI
brew "awscli"
brew "harlequin"
brew "pgcli"
brew "gh"           # GitHub CLI - Interact with GitHub PRs, issues, repos
brew "glab"         # GitLab CLI
brew "ast-grep"
brew "mosh"
brew "ankitpokhrel/jira-cli/jira-cli", trusted: true # Jira CLI
brew "antoniorodr/memo/memo", trusted: true   # Memo taking tool
brew "atlassian/acli/acli", trusted: true     # Atlassian CLI
brew "int128/kubelogin/kubelogin", trusted: true # Kubernetes OpenID Connect authentication
brew "runpod/runpodctl/runpodctl", trusted: true # RunPod CLI
brew "ubicloud/cli/ubi", trusted: true        # Ubicloud CLI
brew "steipete/tap/summarize", trusted: true  # AI text summarization
brew "sheeki03/tap/tirith", trusted: true     # Terminal security guard
brew "asheshgoplani/tap/agent-deck", trusted: true # AI agent tool
brew "rtk"          # CLI proxy to minimize LLM token consumption
brew "tw93/tap/mole", trusted: true           # Terminal tool
brew "modem-dev/tap/hunk", trusted: true      # Review-first terminal diff viewer

#############################################################
# Software Development                                      #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew "gcc"            # GNU C++ compilers
# Languages managed by mise (see ~/.mise.toml): go, node, python, rust, java, lua
brew "oven-sh/bun/bun", trusted: true # Fast all-in-one JavaScript runtime

# Development Utils
brew "mise"           # Runtime manager (asdf rust clone)
brew "uv"
brew "devcontainer"  # Dev Container CLI
brew "duckdb"         # Analytical database
brew "gemini-cli", link: false # Google Gemini CLI
brew "git-extras"    # Extra git commands for common tasks
brew "git-lfs"       # Git large file storage
brew "terminal-notifier" # Trigger Mac notifications from terminal
brew "watchman"      # Watch for changes and reload dev server
brew "poppler"       # PDF utilities
brew "mkcert"        # Local HTTPS development certificates
brew "dive"          # Docker image layer explorer

# Secret Detection
brew "gitleaks"      # Secret scanning tool (primary)
brew "pre-commit"    # Git hook framework

#############################################################
# Shell and Terminal CLI                                    #
#############################################################

brew "git"           # Version control
brew "neovim"        # Text editor
brew "stow"          # Dotfile symlink manager
brew "tmux"          # Terminal multiplexer
brew "tmuxinator"
brew "tmux-sessionizer" # Fuzzy session/repo switcher (tms)
brew "fish"
brew "starship"
brew "yazi"

#############################################################
# Security, Network, and macOS CLI                          #
#############################################################

cask "1password-cli"
cask "codex"         # OpenAI Codex CLI
cask "claude-code@latest"
cask "ngrok"
brew "iproute2mac"   # MacOS port of netstat and ifconfig
